app/controllers/candidates_controller.rb

UPDATE "candidates" SET "votes" = 23, "updated_at" = '2008-10-29 20:14:42' WHERE "id" = 2
---
  def vote
    find_candidate
    @candidate.votes += 1
    @candidate.save

UPDATE "candidates" SET "votes" = 23, "updated_at" = '2008-10-29 20:14:51' WHERE "id" = 2
---
  def unvote
    find_candidate
    @candidate.votes -= 1
    @candidate.save

SELECT * FROM "candidates" ORDER BY first_name asc
SELECT sum("candidates".votes) AS sum_votes FROM "candidates"
---
  def index
    sort_string = "last_name asc"
    sort_order = 'asc'
    sort_order = 'desc' if params[:field] == 'votes'

    sort_string = "#{params[:field]} #{sort_order}" if params[:commit]

    @candidates = Candidate.find(:all, :order => sort_string)
    @vote_sum = Candidate.sum(:votes)

SELECT * FROM "candidates" WHERE ("candidates"."id" = 1)
---
  def show
    @candidate = Candidate.find(params[:id])

SELECT * FROM "candidates" WHERE ("candidates"."id" = 2)
---
  def edit
    @candidate = Candidate.find(params[:id])

INSERT INTO "candidates" ("updated_at", "votes", "first_name", "last_name", "created_at") VALUES('2008-10-29 20:14:20', 11, 'Branimir', 'Šloser', '2008-10-29 20:14:20')
---
  def create
    @candidate = Candidate.new(params[:candidate])

    respond_to do |format|
      if @candidate.save

SELECT * FROM "candidates" WHERE ("candidates"."id" = 4)
DELETE FROM "candidates"
---
  def destroy
    @candidate = Candidate.find(params[:id])
    @candidate.destroy

SELECT * FROM "candidates" WHERE ("candidates"."id" = 2)
---
  def find_candidate
   @candidate = Candidate.find(params[:id])